xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_hal_dma.h
/** @defgroup DMA_BTC_Suspend DMA BTC Suspend Mode
  * @{
  */
#define DMA_BTC_SUSPEND_DISABLE   (0x00000000U)                  /*!< Disable suspend transfer after block transfer completion interrupt    */
#define DMA_BTC_SUSPEND_ENABLE    ((uint32_t)DMA_CCR_BTCSUSP)    /*!< Enable suspend transfer after block transfer completion interrupt      */
/**
  * @}
  */

/** @defgroup DMA_interrupt_enable_definitions DMA interrupt enable definitions
  * @{
  */
#define DMA_IT_TC                         ((uint32_t)DMA_CCR_TCIE)
#define DMA_IT_BTC                        ((uint32_t)DMA_CCR_BTCIE)
#define DMA_IT_HBT                        ((uint32_t)DMA_CCR_HBTIE)
#define DMA_IT_TE                         ((uint32_t)DMA_CCR_TEIE)
/**
  * @}
  */

/** @defgroup DMA_flag_definitions DMA flag definitions
  * @{
  */
#define DMA_FLAG_TC1                      0x00000001U
#define DMA_FLAG_BTC1                     0x00000002U
#define DMA_FLAG_HBT1                     0x00000004U
#define DMA_FLAG_TE1                      0x00000008U
#define DMA_FLAG_TC2                      0x00000010U
#define DMA_FLAG_BTC2                     0x00000020U
#define DMA_FLAG_HBT2                     0x00000040U
#define DMA_FLAG_TE2                      0x00000080U
#define DMA_FLAG_TC3                      0x00000100U
#define DMA_FLAG_BTC3                     0x00000200U
#define DMA_FLAG_HBT3                     0x00000400U
#define DMA_FLAG_TE3                      0x00000800U
#define DMA_FLAG_TC4                      0x00001000U
#define DMA_FLAG_BTC4                     0x00002000U
#define DMA_FLAG_HBT4                     0x00004000U
#define DMA_FLAG_TE4                      0x00008000U
#define DMA_FLAG_TC5                      0x00010000U
#define DMA_FLAG_BTC5                     0x00020000U
#define DMA_FLAG_HBT5                     0x00040000U
#define DMA_FLAG_TE5                      0x00080000U
#define DMA_FLAG_TC6                      0x00100000U
#define DMA_FLAG_BTC6                     0x00200000U
#define DMA_FLAG_HBT6                     0x00400000U
#define DMA_FLAG_TE6                      0x00800000U
#define DMA_FLAG_TC7                      0x01000000U
#define DMA_FLAG_BTC7                     0x02000000U
#define DMA_FLAG_HBT7                     0x04000000U
#define DMA_FLAG_TE7                      0x08000000U
/**
  * @}
  */



/** @defgroup DMA_Channel_map DMA Channel map
  * @{
  */
#define DMA_CHANNEL_MAP_ADC               0U
#define DMA_CHANNEL_MAP_DAC               1U

#define DMA_CHANNEL_MAP_SPI1_RX           3U
#define DMA_CHANNEL_MAP_SPI1_TX           4U
#define DMA_CHANNEL_MAP_SPI2_RX           5U
#define DMA_CHANNEL_MAP_SPI2_TX           6U
#define DMA_CHANNEL_MAP_USART1_RX         7U
#define DMA_CHANNEL_MAP_USART1_TX         8U
#define DMA_CHANNEL_MAP_USART2_RX         9U
#define DMA_CHANNEL_MAP_USART2_TX         10U
#define DMA_CHANNEL_MAP_UART1_RX          11U
#define DMA_CHANNEL_MAP_UART1_TX          12U
#define DMA_CHANNEL_MAP_LPUART1_RX        13U
#define DMA_CHANNEL_MAP_LPUART1_TX        14U
#define DMA_CHANNEL_MAP_I2C1_RX           15U
#define DMA_CHANNEL_MAP_I2C1_TX           16U
#define DMA_CHANNEL_MAP_I2C2_RX           17U
#define DMA_CHANNEL_MAP_I2C2_TX           18U
#define DMA_CHANNEL_MAP_TIM1_CH1          19U
#define DMA_CHANNEL_MAP_TIM1_CH2          20U
#define DMA_CHANNEL_MAP_TIM1_CH3          21U
#define DMA_CHANNEL_MAP_TIM1_CH4          22U
#define DMA_CHANNEL_MAP_TIM1_COM          23U
#define DMA_CHANNEL_MAP_TIM1_TRG          24U
#define DMA_CHANNEL_MAP_TIM1_UP           25U
#define DMA_CHANNEL_MAP_TIM2_CH1          26U
#define DMA_CHANNEL_MAP_TIM2_CH2          27U
#define DMA_CHANNEL_MAP_TIM2_CH3          28U
#define DMA_CHANNEL_MAP_TIM2_CH4          29U
#define DMA_CHANNEL_MAP_TIM2_UP           30U
#define DMA_CHANNEL_MAP_TIM2_TRG          31U
#define DMA_CHANNEL_MAP_TIM3_CH1          32U
#define DMA_CHANNEL_MAP_TIM3_CH2          33U
#define DMA_CHANNEL_MAP_TIM3_CH3          34U
#define DMA_CHANNEL_MAP_TIM3_CH4          35U
#define DMA_CHANNEL_MAP_TIM3_UP           36U
#define DMA_CHANNEL_MAP_TIM3_TRG          37U
#define DMA_CHANNEL_MAP_TIM6_UP           38U
#define DMA_CHANNEL_MAP_TIM7_UP           39U
#define DMA_CHANNEL_MAP_TIM15_CH1         40U
#define DMA_CHANNEL_MAP_TIM15_CH2         41U
#define DMA_CHANNEL_MAP_TIM15_UP          42U
#define DMA_CHANNEL_MAP_TIM15_TRG         43U
#define DMA_CHANNEL_MAP_TIM15_COM         44U
#define DMA_CHANNEL_MAP_TIM16_CH1         45U
#define DMA_CHANNEL_MAP_TIM16_UP          46U
#define DMA_CHANNEL_MAP_TIM17_CH1         47U
#define DMA_CHANNEL_MAP_TIM17_UP          48U
#define DMA_CHANNEL_MAP_LPUART2_RX        50U
#define DMA_CHANNEL_MAP_LPUART2_TX        51U
#define DMA_CHANNEL_MAP_PWM_CH1           52U
#define DMA_CHANNEL_MAP_PWM_CH2           53U
#define DMA_CHANNEL_MAP_PWM_CH3           54U
#define DMA_CHANNEL_MAP_PWM_CH4           55U
#define DMA_CHANNEL_MAP_PWM_UP            56U
#define DMA_CHANNEL_MAP_UART2_RX          57U
#define DMA_CHANNEL_MAP_UART2_TX          58U
#define DMA_CHANNEL_MAP_END               59U
/**
 * @}
 */





/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup DMA_Exported_Macros DMA Exported Macros
  * @{
  */

/** @brief  Reset DMA handle state
  * @param  __HANDLE__ DMA handle.
  * @retval None
  */
#define __HAL_DMA_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = HAL_DMA_STATE_RESET)

/**
  * @brief  Enable the specified DMA Channel.
  * @param  __HANDLE__ DMA handle
  * @retval None
  */
#define __HAL_DMA_ENABLE(__HANDLE__)        ((__HANDLE__)->Instance->CCR |= DMA_CCR_EN)

/**
  * @brief  Disable the specified DMA Channel.
  * @param  __HANDLE__ DMA handle
  * @retval None
  */
#define __HAL_DMA_DISABLE(__HANDLE__)       ((__HANDLE__)->Instance->CCR &= ~DMA_CCR_EN)


/* Interrupt & Flag management */

/**
  * @brief  Enables the specified DMA Channel interrupts.
  * @param  __HANDLE__ DMA handle
  * @param __INTERRUPT__ specifies the DMA interrupt sources to be enabled or disabled.
  *          This parameter can be any combination of the following values:
  *            @arg DMA_IT_TC :  Transfer complete interrupt mask
  *            @arg DMA_IT_BTC:  block transfer complete interrupt mask
  *            @arg DMA_IT_HBT:  Half block transfer complete interrupt mask
  *            @arg DMA_IT_TE :  Transfer error interrupt mask
  * @retval None
  */
#define __HAL_DMA_ENABLE_IT(__HANDLE__, __INTERRUPT__)   ((__HANDLE__)->Instance->CCR |= (__INTERRUPT__))

/**
  * @brief  Disables the specified DMA Channel interrupts.
  * @param  __HANDLE__ DMA handle
  * @param __INTERRUPT__ specifies the DMA interrupt sources to be enabled or disabled.
  *          This parameter can be any combination of the following values:
  *            @arg DMA_IT_TC :  Transfer complete interrupt mask
  *            @arg DMA_IT_BTC:  block transfer complete interrupt mask
  *            @arg DMA_IT_HBT:  Half block transfer complete interrupt mask
  *            @arg DMA_IT_TE :  Transfer error interrupt mask
  * @retval None
  */
#define __HAL_DMA_DISABLE_IT(__HANDLE__, __INTERRUPT__)  ((__HANDLE__)->Instance->CCR &= ~(__INTERRUPT__))

/**
  * @brief  Checks whether the specified DMA Channel interrupt is enabled or disabled.
  * @param  __HANDLE__ DMA handle
  * @param  __INTERRUPT__ specifies the DMA interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg DMA_IT_TC :  Transfer complete interrupt mask
  *            @arg DMA_IT_BTC:  block transfer complete interrupt mask
  *            @arg DMA_IT_HBT:  Half block transfer complete interrupt mask
  *            @arg DMA_IT_TE :  Transfer error interrupt mask
  * @retval The state of DMA_IT (SET or RESET).
  */
#define __HAL_DMA_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__)  ((((__HANDLE__)->Instance->CCR & (__INTERRUPT__)) == (__INTERRUPT__)) ? SET : RESET)

/**
  * @brief  Returns the number of remaining data units in the current DMAy Channelx transfer.
  * @param  __HANDLE__ DMA handle
  *
  * @retval The number of remaining data units in the current DMA Channel transfer.
  */
#define __HAL_DMA_GET_COUNTER(__HANDLE__) ((__HANDLE__)->Instance->CNDTR)





/**
  * @}
  */

